[
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 1",
        "rating": 2,
        "deliverables": "Test something",
        "good_bad": "It is actually quite good. ",
        "better_way": "OK. I think there's gotta be a better way. But I need to check it more. ",
        "wishes": "Uh, I wish that umm, yeah, I think that the project could be better. And umm. And maybe that I can produce a quick mockup and then the the application will be made and work right away. ",
        "timestamp": "2026-01-29T15:24:40.424665"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 2",
        "rating": 3,
        "deliverables": "",
        "good_bad": "",
        "better_way": "",
        "wishes": "",
        "timestamp": "2026-01-29T15:27:03.720045"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 3",
        "rating": 3,
        "deliverables": "I'm trying to find umm, OK, so firstly I already deliver. The. Umm, application? Application the uh new feature, the dialog everything was OK. So now on I will be using this removal for my all my work. ",
        "good_bad": "Umm. Regarding the good and bad and then the good is that umm. I uh, I implemented uh whatever I wanted. But bad is that umm. Uh, we have umm. Uh, the umm. They they process implementation, it is a bit of. Not very structure. So I have to tell the struggle a little bit to tell the agent to do whatever I wanted to work, for example the. Umm, for example is the. Approval review. I need them to review approval whatever I wanted and I also allocated this charge for a linear task application for further development. But first I've already done that in the Germany MD, but it's not working. Maybe I have to do some more? ",
        "better_way": "And umm. Thing that there's gonna be a better way. Uh, because. I have been doing. I have changed the system instruction for a while and sometimes it's good, sometimes it's not. But I am clear that. You know, once I got it running. I mean no, once I stripped in is. Good. It's going to be OK. ",
        "wishes": " I wish that umm, it's not that. How to set up the workflow for antique gravity? It should be simple. Something like. I think that generally still scripting, the strict skills admire still not very good, so I have to script it right?  I wish that that there umm. That are kind of. You know, like the the workflow by. Uh, image by visual. So easier to. I mean easier to work on. Maybe later. ",
        "timestamp": "2026-01-29T15:55:35.367450"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 4",
        "rating": 4,
        "deliverables": "Well, I already installed the Linear FCP server. That's great news. ",
        "good_bad": "The goods are already installed, the shop is finished, it's all right. But the bad is that umm for the work log log, the work lock that I have done for tomorrow, it does not have the uh next section plan. So I think I have to, uh, make one. ",
        "better_way": "Anyway, uh, I think it's. I've already found a better way. Servers are support. Officially by umm. Antique or everyday, so it's all right. ",
        "wishes": "Umm. I wish. We shot umm. You know. Which could be clearer. Instead of, you know, hiding. Umm, in the menu that cannot be seen. ",
        "timestamp": "2026-01-29T16:11:34.910902"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 5",
        "rating": 1,
        "deliverables": "Uh, I got a. Actually, nothing delivered for this. Uh, sessions is pretty bad. ",
        "good_bad": "OK. So I think that I'm not really clear on what to deliver next because I didn't have. I don't have. A way to plan? To plan the next next work. So I guess that umm. I need to have. The work log. Up the next work to appear. Right next to the when I say lock. In order to plan for the network. ",
        "better_way": " OK. So I think that umm. I need to, uh, do it merely so that I can improve my workflow. ",
        "wishes": "Wish that it's been done already. Whether it's not late, I can still do it. ",
        "timestamp": "2026-01-29T16:33:18.191201"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 6",
        "rating": 3,
        "deliverables": "OK. So I work on the necessary planning. How? Help her. Help her. So. Helper. Soccer League City is quite good. Secondly, it's quite good, but umm. Umm. I think that I still have to improve it a lot. Umm. I haven't. Fully delivered. Uh, just that I am working on the requirement and haven't finished testing review it. ",
        "good_bad": "What good is that? I am working on it, but uh, there is some uh. Problem with the requirements, the AI go ahead without informing about the. The task and the plan fermentation or the requirements and. Uh, requires request me to approve. He's not done that, but he jumped straight to imitation, so I have to make it in that first. ",
        "better_way": " I must into my workflow.  It should be. Really you know flow to be continuing continuously without interrupting, so it should be simple as well. Early now is there still, you know, like not act as I like it. Uh, still back and forth a bit, but I am customize it on the way. Hopefully it should be OK. ",
        "wishes": "I wish. The whole crowd in a consistent way. A sure win way to do this instead of just. Writing scripts does not follow by the agent. ",
        "timestamp": "2026-01-29T16:57:56.373957"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 7",
        "rating": 4,
        "deliverables": "OK clearly working on the umm. Uh, final? Update feature. Up planning dialog. Everything is working. ",
        "good_bad": "Hmm, the good thing is that I have. Already come to the final of the invitation. And the bad thing is that, umm. Sometime the AI respond in a way that is. Uh, need confirmation. I still prefer the way that is present. How the uh. Limitation plan. Uh, so that II can confirm review and confirm before it's implemented. ",
        "better_way": "For better way, I think that um. It should be done all right. Not too bad, not too shabby. ",
        "wishes": "Hmm. I wish. I wish that umm. There's some magical things that. Hmm. Can you stand 0? I think you know. I wish that my process could be implemented the way I want it. Not like I have to back and forth with on the script. It's not very, umm, user friendly, right? The. We need a way to. Create. An instruction system instruction in a way that is. Is better. For the system to understand. And to follow suit. ",
        "timestamp": "2026-01-29T17:15:56.686610"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 8",
        "rating": 0,
        "deliverables": "",
        "good_bad": "",
        "better_way": "",
        "wishes": "",
        "status": "completed",
        "timestamp": "2026-01-29T17:24:09.901567"
    },
    {
        "task_name": "Anki",
        "task_id": "#T3",
        "session_num_display": "Session: 1",
        "rating": 4,
        "deliverables": "I have done 15 minutes of Anki flash cars. I think she will have done. ",
        "good_bad": " The good is that I'm quite focused. The bad is that, uh, there are many things that need to be, uh, cleaned up. But I guess that the more time go on, I can do it just fine. \nAlso another bad thing is that. I spend quite a lot of time in the morning for eating breakfast and also for church. You know, like I read it and other things. I think that's not a good practice in the morning since I have to focus on doing. What really an accessory for us. ",
        "better_way": "Umm, you know, like, I think that uh, from now on I should, uh have uh. A promoter of. Uh, run on my. Uh, iPhone? Non stop just lie. How would wait for the computer? So that I can track off the time, not forget about it and try to focus and try to finish thing on time. ",
        "wishes": "I wish. That. There were a big timer in. In my house and it's run and run and run and notify me up things gone by so that I understand how much time has passed. Umm, it's not a background, it's always run non stop. So it's better be stuck somewhere in my house. Uh, like a clock. And always run so.  Uh, I think I can buy a cheap one but with big screen. The thing is I need to display it maybe. I have to make one. For a cheap one by. Maybe buy uh existing one and then try to modify it software.  Umm. OK. So that's it for now. ",
        "status": "completed",
        "timestamp": "2026-01-30T09:36:53.644214"
    },
    {
        "task_name": "Plan for today",
        "task_id": "#T3",
        "session_num_display": "Session: 2",
        "rating": 0,
        "deliverables": "The results of this session should be applied for things to do today. Umm. Including the deliverables, the work that needs to be done.  \nOK dad I have already planned out a little bit for the projects. Another issue for today and I just going to work. ",
        "good_bad": "Umm, the good is that I have, uh, plan out the things. But uh, the bad is that I don't, you know, like, I just umm, plan out the things. Uh, bluntly, not just specific. So umm, it's more like, uh. A private thing is not like having a deadline for delivering anything. So I'm not sure that is bad or it's good, but it's like there's no specific deadline and I think actually it's kind of bad. And it, uh, you know, a certain time to deliver something to be able to achieve. A kind of metric or mount store instead of just keep on delivering. Um, you know, I have to have some kind of, uh, metric. A learning metric for example, or a money metric for example. That I can do but. Firstly, you know my metric could be deliberate every day. Not too bad. I have at least one delivery a day and daily delivery. And I guess you know like at times you know and I will be continued from that, but I think for now I added delivery is very important because that improve my ability to produce production grade applications. ",
        "better_way": "Uh, a better way? Uh, I think the better I would would be that uh, during you know, like I am working with application that I have an idea on uh, that work for me at first, then I can accumulate the, uh, process the assets to develop faster, uh better and Into. Uh, one process, uh. In from the beginning to the end of from ideation to. Uh, planning, development and then publication? Uh, I have to have the whole process and then marketing, advertising as well. And sales for no example. Um. You know, sales maybe later but I need to get users feedback. Support example uh but first is uh I have to publish my app 1st so that I can show my world to the people and they they know about it. Then I stand about it and they can use it and provide feedback. That's what I need for now. So my home process will be, you know, for now it should be stopping at this stage of publication. And receiving feedback that would be good. ",
        "wishes": "Umm. I wish that umm. I wish, I wish that. Umm. I don't have to increase the intensity. Focus. Mission to motivate myself. Hmm, wouldn't this? Uh, I haven't got any motivation, so I need to add that to good and bad for example. I think I need more focus. Uh, more focus and just do it down. Think and uh don't consider, don't have to focus more and more and uh increase intensity by uh, you know, like, uh, work myself up for the job. ",
        "status": "completed",
        "timestamp": "2026-01-30T09:56:32.118014"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 10",
        "rating": 0,
        "deliverables": "OK, so I'm going to continue with the hopefully I can deliver one to two. Issues for now. \nOK now just work on the requirements of. The tomorrow for the pre brain chain. ",
        "good_bad": "Uh, the good is that I already have the requirements that haven't delivered or anything. Uh, but I think it's actually a good thing because, uh, I have to plan to brainstorm first before doing anything else. And that should be the best practice. Uh, insteaUmm, OK. So I think that is you guys focus. Just do it. Don't think I know I can snowball this. Snowball, snowball. Snowball. I guess snowball. Make it better. Snowball. The focus snowball on the UH process. ",
        "better_way": "The better way, um. Yeah, it's gotta be a better way to do it. You know, like more efficient the work. What is work planning. If you have the process. The requirements. You had the requirements everything ready. Maybe it should be done understand by and done by the AI much faster. Maybe. Maybe I'll try. Bye. Umm, a speech? ",
        "wishes": "I wish, I wish, I wish, I wish. Uh, SH on top of anything. Uh no. Uh. Is this uh? Is this something that?   ",
        "status": "completed",
        "timestamp": "2026-01-30T10:12:34.650512"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 11",
        "rating": 4,
        "deliverables": "Umm, I think this one. I'm going to implement that at orange time countdown and I hope that I will be able to finish, uh implement the draft. And testing in the next session. \nUmm, I have created some assets and uh, updated the requirements. So the percent of designing is. I think it's quite done. ",
        "good_bad": "Uh, the good is that the requirement is done, but the bad is that, um, this is unexpected because I thought. That I would be having the feature done by now, but you know that the chance of creating the orange icons not in the, the, the, the, the stop process. So it's uh additional work comparing to what I expected. So. Umm, I think the the moral story is that I have to take into account of time to, uh uh, review the requirement, adjusting the requirement as well as designing uh, the assets for the UH application as well. ",
        "better_way": "OK so. By the way, I don't think I need for now. And I wish. Uh. I use my brain brainstorm trying to think of thing. Uh. Is this a better way? That's got a way better way. Uh. Uh, the insider who resigned. Uh. Help me reside within. I don't have to make the design outside of the CI. I will have to check the MCP server to see if any umm. Design. Or maybe I no, it's just invitation. It's just invitations, not about design. So I have to think about the design myself. It's better that way to separate the process to make it more specialized that way. OK so. That the batch is that I have the reset specialist beside me to help me with all the designs. I wonder if. Anti gravity can play that role. Uh, maybe have to design AA, system instruction specifically for them for him to design. ",
        "wishes": "",
        "status": "completed",
        "timestamp": "2026-01-30T10:30:50.610108"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 12",
        "rating": 0,
        "deliverables": "OK so this uh, we implement that for sure this time and then having the deliverable ready for review if possible, I'm going to test and publish that. \nGood, I have already finished with the application update for the orange. Now I'm going to test it. ",
        "good_bad": "OK. The great thing is that, you know, like I do an conversation with the. AI agents in a way that make them the way I wanted, but I think it should be better if you know, I understand my progress. Progress. And follow it instead of I have to you know, like say it every uh. Every time. You know, sometime maybe, you know, I forget. So I wanted to be structured in that way so that I can build up on that like I have an asset, build an asset instead of just, you know, like um. Knock structure everything and you know like like variation every time. ",
        "better_way": "By the way, uh yeah, just like I told. Uh, I have to have the structure, but uh in a way it's working well. ",
        "wishes": "",
        "status": "completed",
        "timestamp": "2026-01-30T11:14:21.596908"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 13",
        "rating": 3,
        "deliverables": "Occasionally I am working on the two issues of a promoter and also, umm, trying to verify down about the best practice of unit tests. ",
        "good_bad": "Uh, the good is that uh, I am already implemented. Uh, but I haven't tested yet. And interestingly I also come across uh, unit test. And I have to, you know, like I think now I understand a little bit about the unit test. Uh, so I have to find out the bad plastic in order to organize and run the whole unit testing, uh for every deployment? ",
        "better_way": "The better way is that I know I have to understand more about the nature of the test in order to make. Sure that firstly I have to sync and update together with the code and secondly it's got to be. III is it going to be easier to run all the tests? ",
        "wishes": "",
        "status": "completed",
        "timestamp": "2026-01-30T15:22:39.478414"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 14",
        "rating": 1,
        "deliverables": "OK so for this next session I'm going to finish. Our invitation and testing of the new delivery and then maybe you know, like organize a unit test as well. ",
        "good_bad": "",
        "better_way": "",
        "wishes": "",
        "status": "completed",
        "timestamp": "2026-01-30T15:55:46.824532"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 14",
        "rating": 4,
        "deliverables": "Uh, I am, uh, making the requirement and prompt for the, uh, advertising of the app. Uh, I think it's for now. It's quite good. ",
        "good_bad": "OK. Let's go on. ",
        "better_way": "Umm, I think, umm, you know, like, uh onward. I will be more and more adept to this, uh workflow. But for now, let's give it uh, you know, like ad hoc. ",
        "wishes": "I wish. Umm. It's OK. ",
        "status": "completed",
        "timestamp": "2026-01-30T16:12:20.568101"
    },
    {
        "task_name": "Developing michael pomodoro",
        "task_id": "#T1",
        "session_num_display": "Session: 15",
        "rating": 0,
        "deliverables": "I will deliver the video. ",
        "good_bad": "",
        "better_way": "",
        "wishes": "",
        "status": "planned",
        "timestamp": "2026-01-30T16:12:29.211423"
    }
]